MikroElektronika/core_packages/PIC/XC8/def/PIC18LF55K42/mcu.h
extern volatile PIR2bits_t PIR2bits __at(0x39A2);
// bitfield macros
#define _PIR2_DMA1SCNTIF_POSN                               0x0
#define _PIR2_DMA1SCNTIF_POSITION                           0x0
#define _PIR2_DMA1SCNTIF_SIZE                               0x1
#define _PIR2_DMA1SCNTIF_LENGTH                             0x1
#define _PIR2_DMA1SCNTIF_MASK                               0x1
#define _PIR2_DMA1DCNTIF_POSN                               0x1
#define _PIR2_DMA1DCNTIF_POSITION                           0x1
#define _PIR2_DMA1DCNTIF_SIZE                               0x1
#define _PIR2_DMA1DCNTIF_LENGTH                             0x1
#define _PIR2_DMA1DCNTIF_MASK                               0x2
#define _PIR2_DMA1ORIF_POSN                                 0x2
#define _PIR2_DMA1ORIF_POSITION                             0x2
#define _PIR2_DMA1ORIF_SIZE                                 0x1
#define _PIR2_DMA1ORIF_LENGTH                               0x1
#define _PIR2_DMA1ORIF_MASK                                 0x4
#define _PIR2_DMA1AIF_POSN                                  0x3
#define _PIR2_DMA1AIF_POSITION                              0x3
#define _PIR2_DMA1AIF_SIZE                                  0x1
#define _PIR2_DMA1AIF_LENGTH                                0x1
#define _PIR2_DMA1AIF_MASK                                  0x8
#define _PIR2_SPI1RXIF_POSN                                 0x4
#define _PIR2_SPI1RXIF_POSITION                             0x4
#define _PIR2_SPI1RXIF_SIZE                                 0x1
#define _PIR2_SPI1RXIF_LENGTH                               0x1
#define _PIR2_SPI1RXIF_MASK                                 0x10
#define _PIR2_SPI1TXIF_POSN                                 0x5
#define _PIR2_SPI1TXIF_POSITION                             0x5
#define _PIR2_SPI1TXIF_SIZE                                 0x1
#define _PIR2_SPI1TXIF_LENGTH                               0x1
#define _PIR2_SPI1TXIF_MASK                                 0x20
#define _PIR2_SPI1IF_POSN                                   0x6
#define _PIR2_SPI1IF_POSITION                               0x6
#define _PIR2_SPI1IF_SIZE                                   0x1
#define _PIR2_SPI1IF_LENGTH                                 0x1
#define _PIR2_SPI1IF_MASK                                   0x40
#define _PIR2_I2C1RXIF_POSN                                 0x7
#define _PIR2_I2C1RXIF_POSITION                             0x7
#define _PIR2_I2C1RXIF_SIZE                                 0x1
#define _PIR2_I2C1RXIF_LENGTH                               0x1
#define _PIR2_I2C1RXIF_MASK                                 0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x39A3);
#ifndef _LIB_BUILD
asm("PIR3 equ 039A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned TMR0IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x39A3);
// bitfield macros
#define _PIR3_I2C1TXIF_POSN                                 0x0
#define _PIR3_I2C1TXIF_POSITION                             0x0
#define _PIR3_I2C1TXIF_SIZE                                 0x1
#define _PIR3_I2C1TXIF_LENGTH                               0x1
#define _PIR3_I2C1TXIF_MASK                                 0x1
#define _PIR3_I2C1IF_POSN                                   0x1
#define _PIR3_I2C1IF_POSITION                               0x1
#define _PIR3_I2C1IF_SIZE                                   0x1
#define _PIR3_I2C1IF_LENGTH                                 0x1
#define _PIR3_I2C1IF_MASK                                   0x2
#define _PIR3_I2C1EIF_POSN                                  0x2
#define _PIR3_I2C1EIF_POSITION                              0x2
#define _PIR3_I2C1EIF_SIZE                                  0x1
#define _PIR3_I2C1EIF_LENGTH                                0x1
#define _PIR3_I2C1EIF_MASK                                  0x4
#define _PIR3_U1RXIF_POSN                                   0x3
#define _PIR3_U1RXIF_POSITION                               0x3
#define _PIR3_U1RXIF_SIZE                                   0x1
#define _PIR3_U1RXIF_LENGTH                                 0x1
#define _PIR3_U1RXIF_MASK                                   0x8
#define _PIR3_U1TXIF_POSN                                   0x4
#define _PIR3_U1TXIF_POSITION                               0x4
#define _PIR3_U1TXIF_SIZE                                   0x1
#define _PIR3_U1TXIF_LENGTH                                 0x1
#define _PIR3_U1TXIF_MASK                                   0x10
#define _PIR3_U1EIF_POSN                                    0x5
#define _PIR3_U1EIF_POSITION                                0x5
#define _PIR3_U1EIF_SIZE                                    0x1
#define _PIR3_U1EIF_LENGTH                                  0x1
#define _PIR3_U1EIF_MASK                                    0x20
#define _PIR3_U1IF_POSN                                     0x6
#define _PIR3_U1IF_POSITION                                 0x6
#define _PIR3_U1IF_SIZE                                     0x1
#define _PIR3_U1IF_LENGTH                                   0x1
#define _PIR3_U1IF_MASK                                     0x40
#define _PIR3_TMR0IF_POSN                                   0x7
#define _PIR3_TMR0IF_POSITION                               0x7
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x39A4);
#ifndef _LIB_BUILD
asm("PIR4 equ 039A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned                        :1;
        unsigned NCO1IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned CLC1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x39A4);
// bitfield macros
#define _PIR4_TMR1IF_POSN                                   0x0
#define _PIR4_TMR1IF_POSITION                               0x0
#define _PIR4_TMR1IF_SIZE                                   0x1
#define _PIR4_TMR1IF_LENGTH                                 0x1
#define _PIR4_TMR1IF_MASK                                   0x1
#define _PIR4_TMR1GIF_POSN                                  0x1
#define _PIR4_TMR1GIF_POSITION                              0x1
#define _PIR4_TMR1GIF_SIZE                                  0x1
#define _PIR4_TMR1GIF_LENGTH                                0x1
#define _PIR4_TMR1GIF_MASK                                  0x2
#define _PIR4_TMR2IF_POSN                                   0x2
#define _PIR4_TMR2IF_POSITION                               0x2
#define _PIR4_TMR2IF_SIZE                                   0x1
#define _PIR4_TMR2IF_LENGTH                                 0x1
#define _PIR4_TMR2IF_MASK                                   0x4
#define _PIR4_CCP1IF_POSN                                   0x3
#define _PIR4_CCP1IF_POSITION                               0x3
#define _PIR4_CCP1IF_SIZE                                   0x1
#define _PIR4_CCP1IF_LENGTH                                 0x1
#define _PIR4_CCP1IF_MASK                                   0x8
#define _PIR4_NCO1IF_POSN                                   0x5
#define _PIR4_NCO1IF_POSITION                               0x5
#define _PIR4_NCO1IF_SIZE                                   0x1
#define _PIR4_NCO1IF_LENGTH                                 0x1
#define _PIR4_NCO1IF_MASK                                   0x20
#define _PIR4_CWG1IF_POSN                                   0x6
#define _PIR4_CWG1IF_POSITION                               0x6
#define _PIR4_CWG1IF_SIZE                                   0x1
#define _PIR4_CWG1IF_LENGTH                                 0x1
#define _PIR4_CWG1IF_MASK                                   0x40
#define _PIR4_CLC1IF_POSN                                   0x7
#define _PIR4_CLC1IF_POSITION                               0x7
#define _PIR4_CLC1IF_SIZE                                   0x1
#define _PIR4_CLC1IF_LENGTH                                 0x1
#define _PIR4_CLC1IF_MASK                                   0x80

