MikroElektronika/core_packages/PIC/XC8/def/PIC18LF55K42/mcu.h
// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x39A7);
#ifndef _LIB_BUILD
asm("PIR7 equ 039A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned                        :1;
        unsigned CWG2IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned INT2IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x39A7);
// bitfield macros
#define _PIR7_TMR4IF_POSN                                   0x0
#define _PIR7_TMR4IF_POSITION                               0x0
#define _PIR7_TMR4IF_SIZE                                   0x1
#define _PIR7_TMR4IF_LENGTH                                 0x1
#define _PIR7_TMR4IF_MASK                                   0x1
#define _PIR7_CCP2IF_POSN                                   0x1
#define _PIR7_CCP2IF_POSITION                               0x1
#define _PIR7_CCP2IF_SIZE                                   0x1
#define _PIR7_CCP2IF_LENGTH                                 0x1
#define _PIR7_CCP2IF_MASK                                   0x2
#define _PIR7_CWG2IF_POSN                                   0x3
#define _PIR7_CWG2IF_POSITION                               0x3
#define _PIR7_CWG2IF_SIZE                                   0x1
#define _PIR7_CWG2IF_LENGTH                                 0x1
#define _PIR7_CWG2IF_MASK                                   0x8
#define _PIR7_CLC2IF_POSN                                   0x4
#define _PIR7_CLC2IF_POSITION                               0x4
#define _PIR7_CLC2IF_SIZE                                   0x1
#define _PIR7_CLC2IF_LENGTH                                 0x1
#define _PIR7_CLC2IF_MASK                                   0x10
#define _PIR7_INT2IF_POSN                                   0x5
#define _PIR7_INT2IF_POSITION                               0x5
#define _PIR7_INT2IF_SIZE                                   0x1
#define _PIR7_INT2IF_LENGTH                                 0x1
#define _PIR7_INT2IF_MASK                                   0x20

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x39A8);
#ifndef _LIB_BUILD
asm("PIR8 equ 039A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IF                 :1;
        unsigned TMR5GIF                :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x39A8);
// bitfield macros
#define _PIR8_TMR5IF_POSN                                   0x6
#define _PIR8_TMR5IF_POSITION                               0x6
#define _PIR8_TMR5IF_SIZE                                   0x1
#define _PIR8_TMR5IF_LENGTH                                 0x1
#define _PIR8_TMR5IF_MASK                                   0x40
#define _PIR8_TMR5GIF_POSN                                  0x7
#define _PIR8_TMR5GIF_POSITION                              0x7
#define _PIR8_TMR5GIF_SIZE                                  0x1
#define _PIR8_TMR5GIF_LENGTH                                0x1
#define _PIR8_TMR5GIF_MASK                                  0x80

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x39A9);
#ifndef _LIB_BUILD
asm("PIR9 equ 039A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IF                 :1;
        unsigned CCP3IF                 :1;
        unsigned CWG3IF                 :1;
        unsigned CLC3IF                 :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x39A9);
// bitfield macros
#define _PIR9_TMR6IF_POSN                                   0x0
#define _PIR9_TMR6IF_POSITION                               0x0
#define _PIR9_TMR6IF_SIZE                                   0x1
#define _PIR9_TMR6IF_LENGTH                                 0x1
#define _PIR9_TMR6IF_MASK                                   0x1
#define _PIR9_CCP3IF_POSN                                   0x1
#define _PIR9_CCP3IF_POSITION                               0x1
#define _PIR9_CCP3IF_SIZE                                   0x1
#define _PIR9_CCP3IF_LENGTH                                 0x1
#define _PIR9_CCP3IF_MASK                                   0x2
#define _PIR9_CWG3IF_POSN                                   0x2
#define _PIR9_CWG3IF_POSITION                               0x2
#define _PIR9_CWG3IF_SIZE                                   0x1
#define _PIR9_CWG3IF_LENGTH                                 0x1
#define _PIR9_CWG3IF_MASK                                   0x4
#define _PIR9_CLC3IF_POSN                                   0x3
#define _PIR9_CLC3IF_POSITION                               0x3
#define _PIR9_CLC3IF_SIZE                                   0x1
#define _PIR9_CLC3IF_LENGTH                                 0x1
#define _PIR9_CLC3IF_MASK                                   0x8

// Register: PIR10
#define PIR10 PIR10
extern volatile unsigned char           PIR10               __at(0x39AA);
#ifndef _LIB_BUILD
asm("PIR10 equ 039AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IF                 :1;
        unsigned CLC4IF                 :1;
    };
} PIR10bits_t;
extern volatile PIR10bits_t PIR10bits __at(0x39AA);
// bitfield macros
#define _PIR10_CCP4IF_POSN                                  0x0
#define _PIR10_CCP4IF_POSITION                              0x0
#define _PIR10_CCP4IF_SIZE                                  0x1
#define _PIR10_CCP4IF_LENGTH                                0x1
#define _PIR10_CCP4IF_MASK                                  0x1
#define _PIR10_CLC4IF_POSN                                  0x1
#define _PIR10_CLC4IF_POSITION                              0x1
#define _PIR10_CLC4IF_SIZE                                  0x1
#define _PIR10_CLC4IF_LENGTH                                0x1
#define _PIR10_CLC4IF_MASK                                  0x2

