MikroElektronika/core_packages/PIC/XC8/def/PIC18LF55K42/mcu.h
extern volatile RD2PPSbits_t RD2PPSbits __at(0x3A1A);
// bitfield macros
#define _RD2PPS_RD2PPS0_POSN                                0x0
#define _RD2PPS_RD2PPS0_POSITION                            0x0
#define _RD2PPS_RD2PPS0_SIZE                                0x1
#define _RD2PPS_RD2PPS0_LENGTH                              0x1
#define _RD2PPS_RD2PPS0_MASK                                0x1
#define _RD2PPS_RD2PPS1_POSN                                0x1
#define _RD2PPS_RD2PPS1_POSITION                            0x1
#define _RD2PPS_RD2PPS1_SIZE                                0x1
#define _RD2PPS_RD2PPS1_LENGTH                              0x1
#define _RD2PPS_RD2PPS1_MASK                                0x2
#define _RD2PPS_RD2PPS2_POSN                                0x2
#define _RD2PPS_RD2PPS2_POSITION                            0x2
#define _RD2PPS_RD2PPS2_SIZE                                0x1
#define _RD2PPS_RD2PPS2_LENGTH                              0x1
#define _RD2PPS_RD2PPS2_MASK                                0x4
#define _RD2PPS_RD2PPS3_POSN                                0x3
#define _RD2PPS_RD2PPS3_POSITION                            0x3
#define _RD2PPS_RD2PPS3_SIZE                                0x1
#define _RD2PPS_RD2PPS3_LENGTH                              0x1
#define _RD2PPS_RD2PPS3_MASK                                0x8
#define _RD2PPS_RD2PPS4_POSN                                0x4
#define _RD2PPS_RD2PPS4_POSITION                            0x4
#define _RD2PPS_RD2PPS4_SIZE                                0x1
#define _RD2PPS_RD2PPS4_LENGTH                              0x1
#define _RD2PPS_RD2PPS4_MASK                                0x10
#define _RD2PPS_RD2PPS5_POSN                                0x5
#define _RD2PPS_RD2PPS5_POSITION                            0x5
#define _RD2PPS_RD2PPS5_SIZE                                0x1
#define _RD2PPS_RD2PPS5_LENGTH                              0x1
#define _RD2PPS_RD2PPS5_MASK                                0x20

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0x3A1B);
#ifndef _LIB_BUILD
asm("RD3PPS equ 03A1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS0                :1;
        unsigned RD3PPS1                :1;
        unsigned RD3PPS2                :1;
        unsigned RD3PPS3                :1;
        unsigned RD3PPS4                :1;
        unsigned RD3PPS5                :1;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0x3A1B);
// bitfield macros
#define _RD3PPS_RD3PPS0_POSN                                0x0
#define _RD3PPS_RD3PPS0_POSITION                            0x0
#define _RD3PPS_RD3PPS0_SIZE                                0x1
#define _RD3PPS_RD3PPS0_LENGTH                              0x1
#define _RD3PPS_RD3PPS0_MASK                                0x1
#define _RD3PPS_RD3PPS1_POSN                                0x1
#define _RD3PPS_RD3PPS1_POSITION                            0x1
#define _RD3PPS_RD3PPS1_SIZE                                0x1
#define _RD3PPS_RD3PPS1_LENGTH                              0x1
#define _RD3PPS_RD3PPS1_MASK                                0x2
#define _RD3PPS_RD3PPS2_POSN                                0x2
#define _RD3PPS_RD3PPS2_POSITION                            0x2
#define _RD3PPS_RD3PPS2_SIZE                                0x1
#define _RD3PPS_RD3PPS2_LENGTH                              0x1
#define _RD3PPS_RD3PPS2_MASK                                0x4
#define _RD3PPS_RD3PPS3_POSN                                0x3
#define _RD3PPS_RD3PPS3_POSITION                            0x3
#define _RD3PPS_RD3PPS3_SIZE                                0x1
#define _RD3PPS_RD3PPS3_LENGTH                              0x1
#define _RD3PPS_RD3PPS3_MASK                                0x8
#define _RD3PPS_RD3PPS4_POSN                                0x4
#define _RD3PPS_RD3PPS4_POSITION                            0x4
#define _RD3PPS_RD3PPS4_SIZE                                0x1
#define _RD3PPS_RD3PPS4_LENGTH                              0x1
#define _RD3PPS_RD3PPS4_MASK                                0x10
#define _RD3PPS_RD3PPS5_POSN                                0x5
#define _RD3PPS_RD3PPS5_POSITION                            0x5
#define _RD3PPS_RD3PPS5_SIZE                                0x1
#define _RD3PPS_RD3PPS5_LENGTH                              0x1
#define _RD3PPS_RD3PPS5_MASK                                0x20

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0x3A1C);
#ifndef _LIB_BUILD
asm("RD4PPS equ 03A1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS0                :1;
        unsigned RD4PPS1                :1;
        unsigned RD4PPS2                :1;
        unsigned RD4PPS3                :1;
        unsigned RD4PPS4                :1;
        unsigned RD4PPS5                :1;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0x3A1C);
// bitfield macros
#define _RD4PPS_RD4PPS0_POSN                                0x0
#define _RD4PPS_RD4PPS0_POSITION                            0x0
#define _RD4PPS_RD4PPS0_SIZE                                0x1
#define _RD4PPS_RD4PPS0_LENGTH                              0x1
#define _RD4PPS_RD4PPS0_MASK                                0x1
#define _RD4PPS_RD4PPS1_POSN                                0x1
#define _RD4PPS_RD4PPS1_POSITION                            0x1
#define _RD4PPS_RD4PPS1_SIZE                                0x1
#define _RD4PPS_RD4PPS1_LENGTH                              0x1
#define _RD4PPS_RD4PPS1_MASK                                0x2
#define _RD4PPS_RD4PPS2_POSN                                0x2
#define _RD4PPS_RD4PPS2_POSITION                            0x2
#define _RD4PPS_RD4PPS2_SIZE                                0x1
#define _RD4PPS_RD4PPS2_LENGTH                              0x1
#define _RD4PPS_RD4PPS2_MASK                                0x4
#define _RD4PPS_RD4PPS3_POSN                                0x3
#define _RD4PPS_RD4PPS3_POSITION                            0x3
#define _RD4PPS_RD4PPS3_SIZE                                0x1
#define _RD4PPS_RD4PPS3_LENGTH                              0x1
#define _RD4PPS_RD4PPS3_MASK                                0x8
#define _RD4PPS_RD4PPS4_POSN                                0x4
#define _RD4PPS_RD4PPS4_POSITION                            0x4
#define _RD4PPS_RD4PPS4_SIZE                                0x1
#define _RD4PPS_RD4PPS4_LENGTH                              0x1
#define _RD4PPS_RD4PPS4_MASK                                0x10
#define _RD4PPS_RD4PPS5_POSN                                0x5
#define _RD4PPS_RD4PPS5_POSITION                            0x5
#define _RD4PPS_RD4PPS5_SIZE                                0x1
#define _RD4PPS_RD4PPS5_LENGTH                              0x1
#define _RD4PPS_RD4PPS5_MASK                                0x20

